import Markdown from "react-markdown";

function PrivacyPolicy() {
  const PRIVACY_POLICY_TEXT = `
# 개인정보처리방침

저희가 명시적으로 별도의 정책(본 정책이 아님)이 적용된다고 밝히지 않는 한 본 개인정보처리방침(또는 '정책')이 회원님의 스텔라그램 액세스 및 이용에 적용되며 아래 설명된 스텔라그램 개인정보 처리에 대한 정보를 제공합니다.

## **1. 수집하는 정보**

사용자가 스텔라그램을 사용할 때 수집되는 정보는 세 가지 범주로 분류됩니다.  

**1.1 사용자가 제공하는 정보**

서비스를 이용하려면 계정이 필요하며, 계정을 생성하려면 특정 정보를 제공해야 합니다. 마찬가지로, 유료 제품과 서비스를 이용하시는 경우에도 결제 정보 없이는 해당 서비스를 제공해 드릴 수 없습니다. 기본적으로, 다양한 제품과 서비스를 이용하시려면 특정 정보가 필요합니다.

- **개인 계정**  
  계정을 생성하시면 서비스를 제공하기 위해 타사의 몇 가지 제3자 정보 제공에 동의해 주셔야 합니다. 여기에는 이름, 이메일 주소, 프로필 사진이 포함됩니다. 개인이 회원 가입을 위해 입력하는 표시 이름과 사용자 이름을 포함한 프로필 정보는 항상 공개되지만, 실명이나 가명을 사용할 수 있습니다. 또한, 자신의 정체성을 표현하기 위해 여러 개의 스텔라그램 계정을 만들 수 있다는 점도 기억해주세요

**1.2 스텔라그램을 사용할 때 수집되는 정보**

사용자가 스텔라그램 서비스를 이용할 때, 저희는 사용자가 제품 및 서비스를 어떻게 사용하는지에 대한 정보를 수집합니다. 저희는 이 정보를 사용하여 사용자에게 제품 및 서비스를 제공하고, 스텔라그램을 모든 사람에게 더욱 안전하고 존중받는 사이트로 유지하며, 사용자에게 더욱 중요한 서비스를 제공할 수 있도록 합니다.

**사용 정보**   
스텔라그램에서 사용자의 활동에 대한 정보를 수집합니다. 여기에는 다음이 포함됩니다.

- 사용자가 게시하는 게시물 및 기타 콘텐츠(날짜, 애플리케이션, 스텔라그램 버전 포함)이 포함됩니다.
- 다른 사용자의 콘텐츠와의 상호작용(스크랩, 좋아요, 코멘트 등), 다른 사용자가 콘텐츠에서 사용자를 언급하거나 태그한 경우
- 팔로우하는 사람과 나를 팔로우하는 사람 등 플랫폼에서 다른 사람과 상호 작용하는 방식,  암호화된 메시지와 관련된 메타데이터, 메시지 내용, 수신자, 메시지 날짜 및 시간을 포함하여 다이렉트 메시지를 사용하는 시기
- 이메일 등을 통해 사용자와 소통하는 경우, 우리는 해당 소통과 그 내용에 대한 정보를 수집합니다.
- 저희는 사용자가 서비스 전반에서 상호 작용하는 링크(사용자에게 전송된 이메일 포함)에 대한 정보를 수집합니다.

**로그 정보**   
계정을 생성하지 않았거나 로그아웃한 상태라도 사용자가 저희 제품 및 서비스의 콘텐츠를 열람하거나 다른 방식으로 상호작용할 때 다음과 같은 정보를 수집할 수 있습니다.

- IP 주소 및 관련 정보; 브라우저 유형 및 언어, 운영 체제, 참조 웹페이지, 접속 시간, 방문 페이지, 검색어 및 ID(쿼리로 제출되지 않은 검색어 및 ID 포함) 스텔라그램에 표시된 광고, 스텔라그램에서 생성된 식별자, 쿠키와 관련된 식별자, 또한 스텔라그램을 통해 다른 애플리케이션을 설치하는 경우를 포함하여 저희 서비스의 링크를 클릭하거나 보거나 상호 작용할 때 로그 정보를 수신합니다.

**광고**   
스텔라그램에서 제공하는 광고를 보거나 상호작용할 때 해당 광고 보기 또는 상호작용(예: 비디오 광고 또는 프리롤 시청, 광고 클릭 등)에 대한 정보를 수집할 수 있습니다.

**쿠키 및 유사 기술**   
많은 웹사이트와 마찬가지로 저희는 쿠키 및 유사 기술을 사용하여 추가적인 웹사이트 사용 데이터를 수집하고 서비스를 운영합니다. 검색 및 공개 프로필 보기와 같은 저희 서비스의 많은 부분에서는 쿠키가 필요하지 않습니다.

**1.3 제3자로부터 수집한 정보**

다른 온라인 제품 및 서비스를 이용할 경우, 해당 제품 및 서비스는 해당 사용 정보를 저희와 공유할 수 있습니다. (예: 광고 파트너, 개발자, 게시자)

저희의 광고 및 비즈니스 파트너는 브라우저 쿠키 ID, 스텔라그램에서 생성된 식별자, 이메일 주소와 같은 사용자 정보, 인구 통계 또는 관심 데이터, 웹사이트 또는 앱에서 조회한 콘텐츠 또는 수행한 작업 등의 정보를 저희와 공유합니다. 저희의 일부 광고 파트너, 특히 광고주는 저희의 광고 기술을 통합하여 해당 웹사이트 또는 앱에서 유사한 정보를 직접 수집할 수 있도록 허용합니다. 광고 파트너 및 제휴사가 공유하거나 스텔라그램이 광고 파트너 및 제휴사의 웹사이트 및 앱에서 수집한 정보는 사용자가 스텔라그램과 공유하고 스텔라그램이 본 개인정보처리방침의 다른 곳에 설명된 사용자에 대해 수신, 생성 또는 추론하는 다른 정보와 결합될 수 있습니다.

## **2. 정보 사용 방법**

수집한 정보를 어떻게 사용하는지 자세히 설명하는 것은 서비스를 제공하는 시스템의 작동 방식 때문에 간단하지 않습니다. 예를 들어, 동일한 정보가 여러 목적으로 사용되어 궁극적으로 단일 서비스를 제공할 수 있습니다. 궁금한 점이 있으시면 언제든지 문의해 주세요 대략적인 내용은 다음과 같습니다.  

**2.1 서비스를 운영, 개선 및 개인화합니다**

저희는 수집한 정보를 스텔라그램 서비스를 제공하고 운영하는 데 사용합니다. 또한, 더욱 관련성 높은 콘텐츠와 광고를 표시하고, 팔로우할 사람과 주제를 추천하고, 제휴사, 타사 앱 및 서비스를 찾을 수 있도록 지원하는 등 스텔라그램에서 더 나은 경험을 제공하기 위해 수집한 정보를 사용합니다.

사용자의 정보는 사용자의 설정 에 따라 광고 및 스폰서 콘텐츠 서비스를 제공하기 위해 사용되며 , 이를 통해 스텔라그램의 광고가 사용자에게 더욱 관련성 있게 표시됩니다. 또한 이 정보는 광고 효과를 측정하고 사용자의 기기를 인식하여 스텔라그램 안팎에서 사용자에게 광고를 게재하는 데 사용됩니다. 일부 광고 파트너는 저희의 광고 기술을 통합하여 저희가 해당 웹사이트 또는 앱에서 직접 유사한 정보를 수집할 수 있도록 허용하기도 합니다. 광고 파트너 및 제휴사가 공유하거나 스텔라그램이 광고 파트너 및 제휴사의 웹사이트 및 앱에서 수집한 정보는 사용자가 스텔라그램과 공유하고 스텔라그램이 사용자에 대해 수신, 생성 또는 추론하는 다른 정보와 결합될 수 있습니다.

**2.2 안전과 보안을 강화합니다**

저희는 수집한 정보를 사용자, 제품, 서비스 및 계정의 안전과 보안을 위해 사용합니다. 여기에는 신원 확인, 계정 인증, 사기, 무단 사용 및 불법 활동 방지가 포함됩니다. 또한 스텔라그램 콘텐츠의 안전과 품질을 평가하고 개선하기 위해 정보를 사용합니다. 여기에는 스텔라그램의 정책 및 약관, 그리고 관련 법률을 조사하고 시행하는 것이 포함됩니다.

**2.3 서비스를 측정, 분석하고 개선합니다**

저희는 수집한 정보를 사용하여 제품과 서비스의 효과를 측정하고 분석하며, 사용자가 이를 사용하는 방식을 더 잘 이해하여 이를 개선합니다.

**2.4 연구**

사용자가 공유하거나 저희가 수집한 정보는 연구, 설문 조사, 제품 테스트, 문제 해결을 위해 사용되어 저희의 제품과 서비스를 운영하고 개선하는 데 도움이 됩니다.

## **3. 정보 공유**

저희가 사용자의 정보를 공유하는 방식, 공유 이유, 그리고 사용자가 정보를 관리하는 방법을 숙지해 주시기 바랍니다. 저희가 사용자의 정보를 공유하는 일반적인 방법은 다섯 가지입니다.  

**3.1 콘텐츠 및 상호작용을 게시하고 공유할 때**

**일반 대중과 공유**  
사용자 및 회원 가입을 진행하지 않은 일반 대중은 정보를 최대한 광범위하게 공개하도록 스텔라그램에 요청하고 있습니다. 일반 대중은 스텔라그램에서 프로필 정보(예: 이름/가명, 사용자 이름, 프로필 사진)를 포함한 스텔라그램의 일부 콘텐츠를 보기 위해 로그인할 필요가 없습니다.
  
**서비스를 사용하는 다른 사용자와 공유**   
사용자의 설정 과 사용자가 사용하는 저희 제품 및 서비스를 기반으로 저희는 다음을 공유합니다.

- 다른 사용자의 스텔라그램 콘텐츠와 상호작용하는 내용(코멘트, 팔로우하는 사람 등)

**3.2 제3자와의 통합**

**서비스 제공업체와 공유**  
저희 서비스 이용 내역을 파악하는 데 도움을 주는 서비스 제공업체, 잠재적 고용주에게 지원자 및 채용 정보를 송수신하는 지원자 추적 시스템 제공업체, 그리고 사기 탐지 서비스를 제공하는 서비스 제공업체를 포함하여 스텔라그램을 대신하여 기능을 수행하고 서비스를 제공하는 서비스 제공업체와 사용자의 정보를 공유할 수 있습니다. 

**광고주 또는 제3자 광고 플랫폼과 공유**   
광고 수익은 저희의 제품과 서비스를 제공하는 데 도움이 됩니다. 광고주 및 광고 플랫폼은 저희 사이트 안팎에서 사용자가 광고에 참여한 내용을 통해 정보를 얻을 수 있습니다. 예를 들어, 저희 서비스의 외부 링크나 광고를 클릭하면 해당 광고주 또는 웹사이트 운영자는 사용자가 저희 사이트에서 유입되었다는 사실과 함께, 해당 광고와 관련된 기타 정보(예: 광고가 도달하고자 했던 잠재고객의 특성 및 해당 광고에 대해 스텔라그램에서 생성된 기타 식별자)를 파악할 수 있습니다. 또한 쿠키 식별자나 IP 주소와 같은 기타 개인 정보를 수집할 수도 있습니다.

**3.3 법률에 의해 요구될 경우, 피해를 방지하기 위해, 또는 공익을 위해**

저희는 다음과 같이 합리적으로 필요하다고 판단되는 경우 사용자의 정보를 보존, 사용, 공유 또는 공개할 수 있습니다.

- 법률, 규정, 법적 절차 또는 정부 요청을 준수
- 모든 사람의 안전을 보호하고, 저희 플랫폼의 안전이나 무결성을 보호하며, 스텔라그램 서비스에 대한 스팸, 학대 또는 악의적인 행위자를 방지하기 위한 목적
- 스텔라그램 서비스에서 콘텐츠나 계정을 삭제한 이유 설명(예: 규칙 위반)
- 사기, 보안 또는 기술 문제 해결
- 저희의 권리나 재산, 또는 저희 서비스를 이용하는 사람들의 권리나 재산을 보호할 목적

**3.4 소유권 변경으로 인해**

합병, 인수, 구조조정, 자산 매각 또는 파산과 관련하여 사용자의 정보를 공유, 판매 또는 이전할 수 있습니다. 본 개인정보처리방침은 (거래 종료 전후에) 공유되거나 새로운 법인으로 이전되는 사용자의 개인정보에 적용됩니다.

## **4. 정보 보관 기간**

**4.1 명시적인 개인정보 보관 기간**

저희는 제품 및 서비스 제공, 법적 요건 준수, 그리고 안전 및 보안상의 이유로 필요한 보관 기간에 따라 다양한 유형의 정보를 각기 다른 기간 동안 보관합니다. 예를 들면 다음과 같습니다. 

- 저희는 사용자의 계정 유지 기간(정상적이 서비스 이용 기간을 포함하며, 사용자가 자의로, 또는 약관 위반으로 인해 계정이 비활성화 되어 완전히 삭제되기까지의 대기 시간) 동안 표시 이름, 사용자 이름, 비밀번호, 이메일 주소와 같은 프로필 정보를 보관합니다. 이 정보를 보관하지 않으면 저희는 사용자에게 제품 및 서비스를 제공할 수 없습니다.
- 사용자가 게시한 콘텐츠, 다른 사용자의 콘텐츠와의 상호 작용, 플랫폼에서 다른 사람과 상호 작용하는 방식 등의 사용 정보는 사용자의 계정이 유지되는 동안 또는 해당 콘텐츠가 삭제되어 내부 삭제 대기 상태일 때까지 보관됩니다.
- 이메일 등을 통해 사용자와 소통하는 경우, 저희는 법적 의무를 준수하거나 법적 권리를 행사 또는 방어하기 위해 더 오랜 기간 동안 보관해야 하는 경우를 제외하고 해당 소통 및 그 내용에 대한 정보를 최대 18개월 동안 보관합니다.
- 저희는 일반적으로 쿠키를 사용하여 기기 정보, 위치 정보, 유추된 신원 정보 및 로그 정보를 수집합니다. 저희는 쿠키 및 쿠키를 통해 수집된 정보를 최대 12개월 동안 보관합니다.
- 저희는 스텔라그램에서 광고를 보거나 상호작용한 내용에 대한 정보를 최대 12개월 동안 보관합니다. 
- 광고 및 비즈니스 파트너가 공유한 정보는 최대 12개월 동안 보관됩니다.
- 사용자가 저희의 규정을 위반하여 사용자의 계정이 정지된 경우, 저희는 사용자가 계정을 만드는 데 사용한 식별자(예: 이메일 주소 또는 전화번호)를 무기한 보관하여 반복적으로 정책을 위반하는 사람이 새 계정을 만드는 것을 방지할 수 있습니다.

법적 요건을 준수하고 안전 및 보안상의 이유로 특정 정보를 정책에 명시된 기간보다 더 오래 보관해야 할 수 있습니다. 예를 들면 다음과 같습니다.

- **법률, 규정, 법적 절차 또는 정부 요청을 준수하기 위해**  
  여기에는 법 집행 기관의 법적으로 적절한 보존 요청을 준수하기 위한 목적도 포함됩니다.
- **법적 청구, 소송 및 규제 문제와 관련하여**   
  여기에는 저희가 법적 청구로부터 방어하기 위해 사용자의 계정 관련 정보를 보관하는 것이 합리적으로 필요한 경우가 포함됩니다.
- **저희 제품 및 서비스의 안전과 보안을 유지하기 위해**   
  여기에는 저희 제품 및 서비스 남용을 조사하고 방지하기 위해 사용자의 정보를 더 오래 보관해야 하는 경우도 포함됩니다.

공개 콘텐츠는 스텔라그램에서 삭제된 후에도 다른 곳에 존재할 수 있음을 기억해주세요. 예를 들어, 검색 엔진과 기타 제3자 서비스에서는 게시물이 스텔라그램에서 삭제되거나 만료된 후에도 자체 서비스 개인정보처리방침에 따라 게시물 사본을 더 오랫동안 보관할 수 있습니다.


**4.2 개인정보 파기절차 및 방법**

만약 개인이 생산하여 권리를 가지고 있는 콘텐츠 및 개인에 대한 정보를 삭제하길 원하는 경우 각 콘텐츠의 상호작용 버튼을 통해 삭제할 수 있으며,

완전한 삭제 처리를 위해 보관되는 기간보다 더 빠르게 완전한 삭제가 필요한 경우 본 정책의 하단 연락처를 통해 연락해주시면, 명시된 기간보다 빠르게 정보를 처리합니다.

다만 법적 요건을 준수하고 안전 및 보안상의 이유로 삭제 요청을 반려할 수 있으며, 개인에 대한 증명이 요구될 수 있고, 마찬가지로 개인에 대한 증명이 안된다면 요청을 처리하지 않습니다.

데이터는 대부분의 경우 클라우드 서비스를 이용하기 때문에 정보의 파기는 전자적 데이터 파기를 의미합니다.

## **5. 개인정보 처리의 위탁**

저희는 서비스 운영을 위해 회원 정보 및 사용자가 생성한 콘텐츠를 Amazon Web Service에 저장하며, 통계 분석 도구를 통한 데이터 분석을 위해 Google 플랫폼의 하위 서비스를 이용할 수 있습니다. (예시: Google Analytics, Google Adsense 등) 

따라서 데이터가 국외의 기업으로 이전되거나 공유될 수 있고, 서비스의 원활한 데이터 전달(CDN)을 위해 대한민국이 아닌 미국 또는 외국에 위치한 서버로 데이터가 저장될 수 있습니다.

국외로 이전될 수 있는 데이터의 보관 기간은 본 정책의 위(4.1 명시적인 개인정보 보관 기간)에서 확인할 수 있습니다.

## **6. 개인정보의 안전성 확보 조치**

저희는 개인정보 보호법에 따라 다음과 같은 조치를 통해 개인정보를 보호하고 있습니다.

- **접근 통제**  
  AWS 네트워크 인프라의 보안 그룹(Security Group) 설정을 통해 외부 접근을 제한하고 있으며, 관리자 포트 및 DB 포트 등은 IP 기반으로 제한된 인원만 접근할 수 있도록 구성되어 있습니다.
- **물리적 보호**  
  개인정보는 AWS 데이터센터의 클라우드 인프라 내에 보관되며, 해당 인프라는 Amazon이 관리하는 물리적 보안 조치의 보호를 받습니다.
- **기초 보안 환경 유지**  
  서비스 운영 환경은 패치가 적용된 공식 이미지 기반으로 구성되며, 주기적으로 운영 환경을 점검합니다.

별도의 암호화 저장, 침입탐지 시스템(IDS), 악성코드 방지 프로그램, 접근 로그 분석 등의 고급 보안 조치는 현재 별도로 수행하지 않고 있습니다. 향후 보안 수준에 따라 점진적으로 적용할 수 있습니다.

## **7. 사용자의 개인정보 통제**

**7.1 접근, 수정, 이전성**

사용자는 프로필을 편집하고 계정 설정을 조정하여 사용자가 제공한 정보에 접근하고 이를 수정 또는 변경할 수 있습니다 .

사용자의 개인정보를 보호하고 보안을 유지하기 위해, 저희는 사용자의 개인정보 접근 권한을 부여하거나 삭제, 이전 또는 기타 관련 요청을 이행하기 전에 사용자의 신원을 확인하기 위한 조치를 취합니다. 저희는 특정 상황에서 사용자의 접근, 수정 또는 이전 요청을 거부할 수 있습니다. 예를 들어, 사용자가 신원을 확인할 수 없는 경우 접근을 거부할 수 있습니다. 

**7.2 사용자의 정보 삭제**

서비스 내부 정책에 따라 계정이 비활성화되면 데이터가 삭제 대기 상태로 변경됩니다. 비활성화되면 표시 이름, 사용자 이름, 공개 프로필을 포함한 콘텐츠가 스텔라그램에서 더 이상 표시되지 않습니다. 실수로 계정을 비활성화(회원 탈퇴)한 경우, 비활성화 후 최대 90일 동안 사용자 계정을 복원할 수 있습니다.

비활성화된 계정 복원을 목적으로 저희 서비스는 비활성화된 이후 완전히 데이터가 삭제되기까지 기존 사용자의 정보를 유지하기 때문에, 실수가 아닌 자의로 계정을 비활성화 하더라도 최대 90일동안 새로운 사용자 정보와 함께 계정을 생성할 수 없습니다.

만약 복원 대기 기간보다 더 빨리 완전한 사용자 정보 삭제를 원한다면 본 정책의 하단 연락처를 통해 연락해주세요

다만 본 정책 상단(4.2 개인정보 파기절차 및 방법)에 표현된 것 처럼 법적 요건을 준수하고 안전 및 보안상의 이유로 삭제 요청을 반려할 수 있으며, 개인에 대한 증명이 요구될 수 있고, 마찬가지로 개인에 대한 증명이 안된다면 요청을 처리하지 않습니다.


**7.3 공인 대리인 요청**

본인 또는 타인의 정보(본인이 타인의 공인 대리인인 경우)에 대한 접근, 수정 또는 삭제와 관련된 요청을 제출하려면 본 방침 아래의 '연락처' 섹션에 명시된 대로 저희에게 연락하실 수 있습니다. 다만 확인을 위해 추가 정보를 제공해야 할 수도 있습니다.

## **8. 스텔라그램의 사용자**

저희 서비스는 어린이를 대상으로 하지 않으며, 13세 미만인 경우 저희 서비스를 이용할 수 없습니다.  
또한, 사용자는 거주 국가에서 개인 정보 처리에 동의할 수 있는 연령이어야 합니다(일부 국가에서는 부모 또는 보호자가 사용자를 대신하여 동의하도록 허용할 수 있습니다 ).  
저희는 13세 미만 어린이의 개인 정보를 고의로 수집하지 않습니다. 사용자의 자녀가 사용자의 동의 없이 개인 정보를 제공했다는 사실을 알게 된 경우, 본 정책 하단의 연락처를 통해 저희에게 연락해 주십시오.   
13세 미만 어린이가 개인 정보를 제공했다는 사실을 알게 된 경우, 저희는 해당 정보를 삭제하고 해당 어린이의 계정을 해지하는 조치를 취합니다. 

## **9. 본 개인정보처리방침의 변경 사항**

본 개인정보처리방침의 최신 버전은 사용자의 개인정보 처리에 관한 내용이며, 저희는 필요에 따라 본 개인정보처리방침을 수시로 개정할 수 있습니다.  

저희가 본 개인정보처리방침을 개정하고 저희가 중요하다고 판단하는 변경 사항을 적용하는 경우, 본 정책을 변경하기 최소 30일 전에 회원님에게 저희 서비스에 변경된 정책을 포함하거나 또는 이메일 발송을 통해 통지하여, 개정된 개인정보처리방침에 효력이 발생하기 전에 검토할 기회를 제공합니다. 

변경 발효일 이후에도 회원님이 계속 서비스에 액세스하거나 서비스를 이용하실 경우, 회원님은 개정된 처리방침의 적용을 받게 되며, 주기적으로 개인정보처리방침에 관한 변경 내용을 확인해야 할 의무가 있습니다.

만약 개정된 정책에 동의하지 않거나 이 계약에 더 이상 동의하지 않으려면 계정을 삭제하고 더 이상 스텔라그램 서비스에 액세스하거나 스텔라그램 서비스를 사용하지 말아야 합니다.

## **10. 스텔라그램에 연락하는 방법**

본 개인정보처리방침에 대한 의견이나 질문이 있으시면 언제든지 알려주시기 바랍니다. 

저희의 데이터 처리 관행에 대해 우려 사항을 제기하고 싶으시다면 , 아래 연락처를 통해 연락하시기 바랍니다.

책임: 정보보호 담당자  
연락처: stellagram.help@gmail.com

개정일: 2025년 7월 13일   
개정 사유: 
- 부자연스러운 표현 수정
- '7.2 사용자의 정보 삭제' 섹션의 보관 기간 변경 30일 -> 90일

시행일: 2025년 8월 13일
`;

  return (
    <Markdown
      components={{
        h1: ({ node, ...props }) => (
          <h1 className="text-3xl font-bold" {...props} />
        ),
        h2: ({ node, ...props }) => <h2 className="text-2xl" {...props} />,
        p: ({ node, ...props }) => (
          <p className="text-gray-800 my-2" {...props} />
        ),
        ul: ({ node, ...props }) => (
          <ul className="list-disc ml-6" {...props} />
        ),
        li: ({ node, ...props }) => <li className="mb-1" {...props} />,
        a: ({ node, href, ...props }) => (
          <a
            href={href}
            className="text-blue-600 underline"
            target="_blank"
            rel="noopener noreferrer"
            {...props}
          />
        ),
      }}
    >
      {PRIVACY_POLICY_TEXT}
    </Markdown>
  );
}

export default PrivacyPolicy;
