import Markdown from "react-markdown";

function UserAgreement() {
  const USER_AGREEMENT_TEXT = `
# 이용 약관

스텔라그램에 오신 것을 환영합니다.
  
저희가 명시적으로 별도의 약관(본 약관이 아님)이 적용된다고 밝히지 않는 한 본 이용 약관(또는 '약관')이 회원님의 스텔라그램 액세스 및 이용에 적용되며 아래 설명된 스텔라그램 서비스('서비스')에 대한 정보를 제공합니다.

## **1. 스텔라그램 서비스**

저희는 회원님에게 스텔라그램 서비스를 제공하는 것에 동의합니다. 서비스에는 저희가 스텔라그램의 사명을 실현하기 위해 제공하는 모든 스텔라그램 제품, 기능, 앱, 서비스, 기술, 소프트웨어가 포함됩니다. 스텔라그램은 회원님이 사랑하는 사람들과 사항들을 더 가까이 접할 기회를 마련하는 것을 사명으로 삼습니다. 서비스는 다음과 같은 부분으로 구성됩니다.

- **창작, 연결, 커뮤니케이션, 발견, 공유를 위한 맞춤화된 기회를 제공합니다.** 사람들은 다양합니다. 따라서 저희는 회원님이 스텔라그램 안팎에서 창작하고, 공유하고, 인지도를 높이고, 사람들과 소통하는 데 도움이 되는 여러 가지 기능을 제공합니다. 저희는 또한 회원님이 실제로 관심을 가지는 경험을 공유함으로써 관계를 강화하길 원합니다. 따라서 저희는 회원님 및 다른 사람들이 관심 있는 사람과 사항을 파악하는 시스템을 구축하고, 파악한 정보를 이용하여 회원님이 중요한 경험을 생성하고, 발견하며, 이에 참여하고, 이를 공유하도록 돕습니다. 그 일환으로 회원님 및 다른 사람들이 스텔라그램 안팎에서 하는 활동에 기초하여 회원님이 관심을 가질 만한 콘텐츠, 기능, 혜택, 계정을 더 잘 보여드리고 회원님에게 스텔라그램을 경험하는 방법을 제안하기도 합니다.
- **긍정적이고 포괄적이며 안전한 환경을 조성합니다.**  
    저희는 저희 커뮤니티 회원들이 도움을 필요로 한다고 생각하는 경우를 포함하여 회원들의 경험을 긍정적이고 폭넓게 만들도록 도구를 개발 및 사용하고, 자원을 제공합니다. 또한 저희는 오용 또는 유해한 콘텐츠에 관한 정보를 사법당국에서 요청하는 경우 공유할 수 있습니다.
- **성장하고 있는 저희 커뮤니티에 지속적으로 서비스를 제공하는 데 도움이 되는 기술을 개발하고 사용합니다.**  
    성장하고 있는 저희 커뮤니티를 위해 정보를 구성하고 분석하는 것이 저희 서비스의 핵심입니다. 저희 서비스에서 큰 부분을 차지하는 커뮤니티 기능을 위하여 저희 서비스를 맞춤화하고, 보호하며, 개선시키는 데 도움이 되는 기술을 개발하고 사용합니다.
- **회원님이 관심 있는 방식으로 회원님과 브랜드, 제품, 서비스를 연결합니다.**  
    저희는 회원님에게 의미 있다고 생각되는 광고, 제안, 기타 홍보 콘텐츠를 보여드리기 위해 스텔라그램 이용 정보 외에도 제3자의 정보를 이용합니다. 그리고 저희는 해당 콘텐츠를 회원님의 스텔라그램에서의 다른 경험만큼 관련성 있게 만들기 위해 노력합니다.
- **연구 및 혁신.**  
    저희는 보유하고 있는 정보를 이용하여 저희 서비스를 연구하고, 다른 사람들과 협력하여 저희 서비스를 보다 개선하고 저희 커뮤니티의 복지에 기여하기 위한 연구를 수행합니다.


## **2. 서비스의 재정 조달 방식**

스텔라그램의 사용료를 지불하지 않는 대신, 본 약관이 적용되는 서비스를 사용함으로써, 회원님은 비즈니스 및 단체들이 홍보를 위해 저희 또는 제3자에게 비용을 지불한 광고를 스텔라그램 내외부에서 보게 될 수 있다는 것을 인정합니다. 저희는 회원님과 관련성이 높은 광고를 보여드리기 위해 회원님의 활동 및 관심사에 대한 정보 등 회원님의 개인정보를 활용합니다.

저희는 회원님에게 회원님과 관련성 있고 유용한 광고를 노출하되, 광고주에게 회원님의 신원을 알리지는 않습니다. 저희는 회원님의 개인정보를 판매하지 않습니다. 저희는 광고주가 저희에게 비즈니스 목표, 광고를 노출하고자 하는 대상의 유형 등을 알릴 수 있도록 허용합니다. 저희는 그 후 관심이 있을 만한 사람에게 해당 광고를 노출합니다.

저희는 또한 사람들이 스텔라그램 내부와 외부에서 광고플랫폼의 콘텐츠와 어떻게 상호작용하고 있는지 이해할 수 있도록 광고플랫폼이 광고의 성과 보고서를 측정할 수 있도록 정보를 제공합니다. 예를 들어 광고플랫폼이 광고의 타겟을 더 잘 이해할 수 있도록 저희는 일반적 인구 통계학적 특성 정보 및 관심사 정보를 광고플랫폼에게 제공할 수 있습니다. 저희는 회원님이 구체적으로 허락하지 않는 한 회원님을 직접적으로 식별할 수 있는 정보(이름 또는 이메일 주소와 같이 그 정보만으로 회원님에게 연락을 취하는 데 이용될 수 있거나 회원님을 식별할 수 있는 정보)를 공유하지 않습니다.

콘텐츠에 언급된 비즈니스 파트너와의 상업적 관계를 기반으로 제품 또는 서비스를 홍보하는 계정의 소유자가 게시한 브랜디드 콘텐츠가 스텔라그램에 표시될 수 있습니다.


## **3. 개인정보처리방침**

저희 서비스를 제공하기 위해서 회원님의 정보를 수집하고 이용해야 합니다. 개인정보처리방침은 저희가 정보를 수집, 이용하고 공유하는 방법에 대해 설명하며, 스텔라그램을 사용하려면 개인정보처리방침에 동의해야 합니다.


## **4. 회원님의 약속**

서비스 제공에 대한 저희의 약속에 상응하여 회원님은 다음과 같은 약속을 해주셔야 합니다.

**4.1 스텔라그램을 사용할 수 있는 사람** 저희는 저희 서비스가 가능한 개방적이고 포괄적인 서비스가 되기를 원하지만, 또한 본 서비스가 안전하고, 보안성을 갖추며, 법을 준수하는 서비스가 되기를 원합니다. 따라서 회원님이 스텔라그램 커뮤니티에 참여하려면 몇 가지 제한 사항을 준수해야 합니다.

- 회원님은 관련 법률에 따라 저희 서비스를 받는 것이 일부라도 금지된 사람 또는 관련 제재 대상 명단에 있어 결제 관련 서비스를 이용하는 것이 금지된 사람이 아니어야 합니다.
- 과거에 저희가 회원님의 계정을 법률 또는 스텔라그램 정책 위반을 이유로 하여 비활성화한 적이 없어야 합니다.
- 회원님은 유죄 판결을 받은 성범죄자가 아니어야 합니다.

**4.2 스텔라그램을 사용할 수 없는 경우** 커뮤니티에 안전하고 개방적인 서비스가 제공되기 위해서는 우리 모두가 각자의 본분을 다해야 합니다.

- **다른 사람을 사칭하거나 부정확한 정보를 제공하면 안 됩니다.**  
    스텔라그램에서 회원님의 신원을 공개할 필요는 없지만, 본인이 아닌 다른 사람이나 단체를 사칭해서는 안 되며, 다른 사람의 명시적인 허락 없이 다른 사람의 이름으로 계정을 만들 수 없습니다.
- **불법적이거나, 오해의 소지가 있거나, 사기적인 행위 또는 불법적이거나 허가받지 않은 목적을 위한 어떠한 행위도 하면 안 됩니다.**
- **회원님은 커뮤니티 규정(본 약관의 6번 항목)을 포함하여 본 약관 또는 저희 정책을 위반(또는 다른 사람이 위반하도록 지원 또는 조장)하거나 회피하려고 시도해서는 안 됩니다.**  
    브랜디드 콘텐츠를 게시하는 경우 회원님은 다른 이용자에게 불편하지 않은 콘텐츠를 포함하여야 하며, 강압적이거나, 다른 이용자의 불편함을 초래할 수 있는 반복적인 게시 행위를 하지 말아야 합니다.
- **귀하는 서비스의 정상적인 운영을 방해하거나 지장을 주는 어떠한 일도 해서는 안 됩니다.**  
    여기에는 사기성이 짙거나 근거 없는 신고 또는 재고 요청 등 신고, 분쟁 또는 재고 요청 채널의 오용이 포함됩니다.
- **허가받지 않은 방법으로 계정을 만들거나 정보에 접근하거나 정보를 수집하려 해서는 안 됩니다.**  
    여기에는 해당 자동 액세스 및 수집이 스텔라그램 계정에 로그인한 동안 수행되는지 여부와 관계없이, 저희의 명시적 허가 없이 계정을 만들고 자동화된 방식으로 정보에 액세스하고 정보를 수집하는 행위가 포함됩니다.
- **회원님은 해당 데이터를 스텔라그램 계정에 로그인한 동안 획득했는지 여부와 관계없이 저희 또는 저희 서비스로부터 획득한 계정 또는 데이터를 판매하거나 라이선스를 부여하거나 구매해서는 안 됩니다.** 
    여기에는 회원님 계정의 일부(사용자 이름 포함) 또는 전부에 대한 구매, 판매 또는 양도가 포함되며, 다른 사용자의 로그인 정보나 배지를 요청, 수집 또는 이용하는 행위 및 스텔라그램 사용자 이름, 비밀번호, 부적절한 액세스 토큰에 대한 요청 또는 수집 행위가 포함됩니다.
- **회원님은 다른 사람의 사생활 정보 또는 기밀 정보를 허가 없이 게시할 수 없으며 지식재산권을 포함하여 다른 사람의 권리를 침해하는 행위(예: 저작권 침해, 상표권 침해, 위조, 불법복제품)를 하여서는 안 됩니다.**  
    회원님은 관련법의 저작권 및 관련 권리에 관한 예외 또는 제한 사항에 따라 다른 사람의 저작물을 사용할 수 있습니다. 회원님은 콘텐츠를 게시하거나 공유하기 위한 모든 권리를 소유하고 있거나 얻었음을 진술합니다. 만약 회원님의 지식재산권을 침해한다고 생각되는 콘텐츠는 각 콘텐츠의 상호작용 버튼을 통해 신고하거나, 사법당국 또는 문의 메일을 통해 신고할 수 있습니다.
- **회원님은 저희의 제품 또는 그 구성 요소를 수정, 변환할 수 없으며, 그 2차적 저작물을 제작하거나 역설계를 수행해서는 안 됩니다.**
- **저희의 사전 서면 동의 없이 회원님의 사용자 이름에 도메인 이름이나 URL을 사용하면 안 됩니다.**
- **회원님은 서비스 또는 데이터에 대한 액세스를 관리하거나 제어하는 기술적 수단을 회피, 우회 또는 재정의하거나 재정의하려고 시도해서는 안 됩니다.**

**4.3 회원님이 저희에게 부여한 권한.** 본 계약의 일부로서, 회원님은 또한 저희가 회원님에게 서비스를 제공하기 위해 필요로 하는 권한을 저희에게 부여합니다.

- **저희가 회원님의 콘텐츠에 대한 소유권을 주장하지 않는 것과는 별개로, 회원님은 저희에게 회원님 콘텐츠 사용을 허용하는 라이선스를 부여합니다.** 
    회원님의 콘텐츠에 대한 회원님의 권리에 있어 변경되는 사항은 없습니다. 저희는 회원님이 서비스에 또는 서비스를 통해 게시하는 콘텐츠에 대한 소유권을 주장하지 않으며 회원님은 원하는 곳 어디에서나 다른 사람들과 자유롭게 콘텐츠를 공유할 수 있습니다. 그러나 저희가 서비스를 제공하기 위해서는 회원님으로부터 특정 법적 권한('라이선스')을 부여받아야 합니다. 회원님이 저희 서비스에서 또는 저희 서비스와 관련하여 지식재산권이 적용되는 콘텐츠(사진 또는 동영상 등)를 공유, 게시 또는 업로드하는 경우, 회원님은 회원님의 콘텐츠를 호스팅, 사용, 배포, 수정, 실행, 복사, 공개적으로 수행 또는 표시, 번역 및 그 파생된 저작물을 생성할 수 있는 비독점적이고, 사용료가 없으며, 양도 가능하고, 재라이선스가 가능하며, 전 세계적인 라이선스를 저희에게 부여합니다(회원님의 개인정보처리방침 및 애플리케이션 설정과 일치함). 이러한 라이선스는 저희 서비스에 접속하고 이를 이용하는 회원님 및 다른 사람들에게 저희 서비스 이용을 가능하게 하기 위한 것입니다. 회원님은 회원님의 콘텐츠를 개별적으로 삭제하거나 계정 삭제를 통해 한 번에 모두 삭제할 수 있습니다.
- **회원님의 사용자 이름, 프로필 사진, 계정·광고·홍보 콘텐츠에 대한 회원님의 관계 및 행동 관련 정보를 이용할 수 있는 권한.**  
    회원님은 저희에게 회원님의 사용자 이름, 프로필 사진 및 회원님의 활동(예: '좋아요') 또는 관계(예: '팔로우')에 관한 정보를 스텔라그램 전반에 표시되는 계정, 광고, 제안 및 회원님이 팔로우하거나 참여하는 기타 홍보 콘텐츠와 함께 또는 이와 관련하여 표시할 수 있는 권한을 무상으로 부여합니다. 예를 들어, 저희는 회원님이 스텔라그램에 유료로 광고를 게재하는 브랜드의 홍보 게시물에 좋아요를 눌렀다는 점을 표시할 수 있습니다. 다른 콘텐츠에서의 행동 및 다른 계정에 대한 팔로우와 마찬가지로, 홍보 콘텐츠에서의 행동 및 홍보 계정에 대한 팔로우도 해당 콘텐츠나 팔로우를 볼 수 있는 권한이 있는 사람들에게 표시됩니다.
- **회원님은 저희가 회원님의 기기에서 서비스 업데이트를 다운로드하고 설치할 수 있다는 것에 동의합니다.**


## **5. 스텔라그램이 보유하는 추가적인 권리**

- 회원님이 회원님의 계정을 위해 사용자 이름 또는 이와 유사한 식별자를 선정할 경우, 저희는 적절하거나 필요하다고 판단될 경우 이를 변경할 수 있습니다(예: 타인의 지식재산권을 침해하거나 다른 사용자 또는 기업 등의 단체를 사칭 또는 오해하도록 설정하는 경우).
- 저희 서비스가 소유하고 서비스 내에서 사용하도록 한 지식재산권의 적용을 받는 콘텐츠(예: 회원님이 생성하거나 공유하는 콘텐츠에 추가되는 저희가 제공한 이미지, 디자인, 동영상 또는 사운드)를 회원님이 사용하는 경우, 저희는 해당 콘텐츠에 대해 모든 권리를 보유하되 회원님 고유의 콘텐츠에 대한 권리는 보유하지 않습니다.
- 회원님은 저희의 사전 서면 허락을 통해 명백하게 허락을 받은 경우에만 저희의 지식재산권 및 상표 또는 비슷한 표시를 사용할 수 있습니다.
- 회원님이 저희의 소스 코드를 수정하거나, 소스 코드에 대한 2차적 저작물을 제작하거나, 소스 코드를 역컴파일하거나 기타 방법으로 소스 코드 추출을 시도하기 위해서는 저희의 서면 허락 또는 오픈 소스 라이선스에 의거한 허락을 받아야 합니다.


## **6. 커뮤니티 규정**

서비스 제공에 대한 저희의 약속에 상응하여 회원님은 다음과 같은 목록에 부합하는 행위를 하여서는 안됩니다.

- 가해 행위 도모 및 범죄 조장
- 위험한 단체 및 개인 행위
- 사기, 스캠 및 기만적 행위
- 규제 상품 및 서비스
- 폭력 및 선동
- 성인 대상 나체 이미지 및 성적 행위와 성적 학대
- 따돌림 및 괴롭힘
- 아동 대상 성적 학대, 학대 및 나체 이미지
- 인신 착취
- 자살, 자해 및 섭식 장애
- 성인 성매매 알선 및 성적으로 노골적인 표현
- 혐오 행동
- 개인정보 보호 위반
- 폭력적이고 자극적인 내용
- 사이버 보안 침해
- 허위 행동
- 잘못된 정보
- 스캠
- 제3자 지식재산권 침해
- 스텔라그램 지식재산권 및 라이선스 사용
- 특정 지역 내 불법 콘텐츠, 제품 또는 서비스
- 다른 인물 또는 단체에 대한 도용 및 사칭

## **7. 콘텐츠 삭제 및 계정 비활성화 또는 해지**

- 회원님이 서비스에서 공유하는 콘텐츠나 정보가 본 이용 약관, 저희 정책(6. 커뮤니티 규정 포함)에 위배된다고 판단되거나 법에 따라 삭제해야 할 경우, 저희는 이를 삭제할 수 있으며, 추가적인 맥락을 제공하기 위해 저희가 콘텐츠에 알림을 추가할 수도 있습니다. 저희는 저희 커뮤니티 또는 서비스를 보호하기 위해 또는 회원님이 저희에게 위험 또는 법적 문제를 일으키거나, 본 약관 또는 저희 정책(6. 커뮤니티 규정 포함)을 위반하거나, 다른 사람의 지식재산권을 반복적으로 침해하거나, 법률에 따라 허용되거나 요구되는 경우에 회원님에게 서비스 전부 또는 일부를 제공하는 것을 즉시 중단하거나 거부할 수 있습니다. 저희에게 법적으로 불리하거나 규제적 영향을 끼치는 상황을 피하거나 줄이기 위해 필요하다고 합리적으로 판단되면, 저희는 서비스를 해지 또는 변경하거나, 서비스에서 공유된 콘텐츠 또는 정보를 삭제 또는 차단하거나, 서비스 전부 또는 일부를 제공하는 것을 중단할 수 있습니다. 회원님의 계정이 오류로 인해 해지되었다고 생각되는 경우 저희에게 문의하세요. 콘텐츠 또는 계정의 삭제를 요청하는 경우 콘텐츠 삭제 프로세스가 진행되는 동안 콘텐츠는 사용자에게 표시되지 않지만 계속해서 본 이용 약관 및 개인정보처리방침의 적용을 받습니다. 콘텐츠가 삭제된 후에는 백업과 재난 복구 시스템에서 삭제하는 데 더 긴 기간이 더 걸릴 수 있습니다.
- 다음과 같은 경우에는 콘텐츠는 계정 삭제 또는 콘텐츠 삭제 프로세스가 시작된 후에도 서비스 이용 접근에 관리될 수 있도록 삭제되지 않습니다.
    
    - 다른 사람이 이 라이선스에 따라 콘텐츠를 이용하였고 아직 삭제하지 않은 경우(이 경우 콘텐츠가 삭제될 때까지 해당 라이선스가 계속 적용됨) 또는
    - 저희 시스템의 기술적 제한으로 인해 특정 기간 내 삭제가 가능하지 않은 경우(그러한 경우 저희는 기술적으로 가능해지는 즉시 콘텐츠를 삭제함) 또는
    - 즉시 삭제하면 다음과 같은 저희의 조치가 제한될 수 있는 경우
        
        - 불법 활동 또는 저희 약관 및 정책 위반 사항에 대한 조사 또는 규명(예: 저희 제품 또는 시스템 오용 사례의 조사 또는 규명)
        - 저희 제품, 시스템, 사용자의 안전 및 보안 보호
        - 증거 보존 등 법적 의무의 준수 또는
        - 사법 또는 행정 당국, 법 집행 기관 또는 정부 기관의 요청 준수,
        
    - 이 경우 콘텐츠는 콘텐츠가 유지된 목적에 필요한 기간 동안 유지됩니다.
    
- 회원님이 계정을 삭제했거나 저희가 회원님의 계정을 비활성화했고 회원님이 스텔라그램 액세스 또는 이용을 중단하거나 본 계약이 다른 방식으로 종료되면 본 약관은 회원님과 저희의 계약으로서 해지되나, 본 조항, 상기 조항('회원님의 약속 및 커뮤니티 규정 위반'), 하기 조항('계약 및 상호 의견이 합치되지 않는 경우')은 계정이 해지, 비활성화 또는 삭제되거나 본 계약이 다른 방식으로 종료된 후에도 여전히 적용됩니다.


## **8. 계약 및 상호 의견이 합치되지 않는 경우**

**8.1 스탤라그램과의 계약**

- 서비스를 통한 회원님의 음악 사용 역시 저작권 및 관련 권리가 적용됩니다. 회원님이 기타 특정 기능 또는 관련 서비스를 이용하는 경우, 회원님은 추가 약관에 대해 동의할 기회를 제공받으며, 추가 약관은 저희와 회원님 간의 계약의 일부를 구성합니다. 예를 들어, 회원님이 결제 기능을 사용하는 경우, 회원님은 커뮤니티 결제 약관에 동의해야 하며, 추가 약관이 본 계약과 상충될 경우 추가 약관이 우선합니다.
- 본 계약의 일부가 이행 불가능한 경우에도, 나머지 부분은 계속해서 효력을 갖습니다.
- 본 계약의 개정이나 면제는 저희가 작성하고 서명한 서면으로만 가능합니다. 저희가 본 계약의 일부를 이행하지 못하더라도, 이는 계약의 포기로 간주되지 않습니다.
- 저희는 회원님에게 명시적으로 부여되지 않은 모든 권리를 보유합니다.

**8.2 본 계약에 따른 권리 보유자**

- 본 계약은 제3자에게 권리를 부여하지 않습니다.
- 회원님은 본 계약에 따른 회원님의 권리나 의무를 저희의 동의 없이 타인에게 양도할 수 없습니다.
- 저희의 권리와 의무는 타인에게 양도될 수 있습니다. 이러한 양도는, 예를 들어, (인수합병이나 자산매각으로 인해) 저희의 소유권이 변경되는 경우 또는 법률에 의해 이뤄질 수 있습니다.

**8.3 유사시의 책임자**

- 저희 서비스는 '있는 그대로' 제공되며, 저희는 저희의 서비스가 안전성과 보안성을 갖춘 채 제공된다거나 항상 완벽하게 작동한다고 보장할 수 없습니다. 또한, 관련 법률이 허용하는 한도 내에서 저희는 상업성, 특정 목적을 위한 적합성, 권원 및 비침해성에 대한 묵시적 보증을 포함하여 모든 명시적이든 묵시적이든 일체의 보증을 부인합니다.
- 또한 저희는 사람들의 활동이나 말을 통제하지 않으며, 사람들(또는 회원님)의 활동이나 행동(온라인, 오프라인 불문) 또는 콘텐츠(불법 또는 유해 콘텐츠 포함)에 대해 책임지지 않습니다. 또한 저희는 다른 사람이나 기업에서 제공하는 서비스와 기능에 대해서도 책임지지 않습니다. 회원님이 저희 서비스를 통해 이러한 서비스와 기능에 접속하더라도 마찬가지입니다.
- 서비스에서 발생하는 모든 사안에 대한 저희의 책임은 법률이 허용하는 범위 내에서 최대한도로 제한됩니다. 저희는 저희 서비스에 문제가 있는 때 해당 문제가 끼칠 수 있는 모든 발생 가능한 영향을 알 수 없습니다. 회원님은 본 약관으로부터 또는 본 약관과 관련하여 발생하는 수익, 수입, 정보 또는 데이터의 손실이나 파생적, 특수적, 간접적, 전형적, 징벌적, 우발적 손해에 대해, 저희가 그 발생 가능성을 알고 있었는지 여부를 불문하고, 저희는 책임지지 않는다는 것에 동의합니다. 여기에는 저희가 회원님의 콘텐츠, 정보 또는 계정을 삭제하는 경우도 포함됩니다.
- 단, 위와 같은 규정에도 불구하고, 관련 법률에 의해 위 규정에 따른 책임 제한이나 면제가 허용되지 않을 수 있습니다. 이 경우, 저희는 해당 법률이 규정하는 범위 내에서 책임을 부담합니다.

**8.4 분쟁 해결 방법**

회원님이 소비자인 경우 또는 관련 법률이 요구하는 경우, 회원님이 거주하는 국가의 법률이 본 약관과 관련하여 발생하는 회원님의 모든 청구, 소송 사유 또는 분쟁('청구')에 적용되고, 회원님은 관할권이 있는 국가의 관할 법원에서 해당 청구를 해결할 수 있습니다. 다른 모든 경우에 회원님은 해당 청구가 대한민국 법원에서만 해결되어야 하며, 해당 청구의 소송 목적에 대해 이러한 법원 중 한 곳의 속인적 관할권을 따르고, 국제사법과 관계없이 본 이용 약관 및 모든 청구에 대한민국 주법이 적용된다는 것에 동의합니다. 앞선 내용을 침해하지 않는 범위에서, 회원님이 저희 제품에 대해 악용, 방해 또는 무단 사용을 시도하는 경우 단독 재량에 따라 회원님이 거주하며 청구의 관할권이 있는 국가에서 회원님에 대한 관련 청구를 제출할 수 있음에 회원님은 동의합니다.

**8.5 요청하지 않은 자료**

저희는 피드백 또는 기타 제안을 언제든 환영하지만, 이를 어떠한 제한 또는 보상 의무 없이 활용할 수 있고, 이를 기밀로 유지할 의무가 없습니다.


## **9. 본 약관 개정**

저희는 저희 서비스 및 정책을 변경할 수 있고, 저희 서비스 및 정책이 정확하게 반영되도록 하기 위해 본 약관을 변경해야 할 경우가 있습니다. 법에서 별도로 요구하는 경우를 제외하고 저희는 본 약관을 변경하기 최소 30일 전에 회원님에게 저희 서비스 또는 이메일 발송을 통해 통지하여, 약관에 효력이 발생하기 전에 검토할 기회를 제공합니다. 변경 발효일 이후에도 회원님이 계속 서비스에 액세스하거나 서비스를 이용하실 경우, 회원님은 개정된 약관의 적용을 받게 되며, 주기적으로 이용 약관 개정에 관한 변경 내용을 확인해야 할 의무가 있습니다. 개정된 약관에 동의하지 않거나 이 계약에 더 이상 동의하지 않으려면 계정을 삭제하고 더 이상 스텔라그램 서비스에 액세스하거나 스텔라그램 서비스를 사용하지 말아야 합니다.

시행일: 2025년 7월 10일
`;

  return (
    <Markdown
      components={{
        h1: ({ node, ...props }) => (
          <h1 className="text-3xl font-bold" {...props} />
        ),
        h2: ({ node, ...props }) => <h2 className="text-2xl" {...props} />,
        p: ({ node, ...props }) => (
          <p className="text-gray-800 my-2" {...props} />
        ),
        ul: ({ node, ...props }) => (
          <ul className="list-disc ml-6" {...props} />
        ),
        li: ({ node, ...props }) => <li className="mb-1" {...props} />,
        a: ({ node, href, ...props }) => (
          <a
            href={href}
            className="text-blue-600 underline"
            target="_blank"
            rel="noopener noreferrer"
            {...props}
          />
        ),
      }}
    >
      {USER_AGREEMENT_TEXT}
    </Markdown>
  );
}

export default UserAgreement;
